> # *Crop Recommendation Analysis*

## Import Modules required

In [1]:
# import libraries

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

## Data Overview

In [2]:
# load dataset and take overview

dataset = pd.read_csv("../Datasets/Crop_Recommendation_Dataset.csv")
dataset.head()

    N   P   K  temperature   humidity        ph    rainfall label
0  90  42  43    20.879744  82.002744  6.502985  202.935536  rice
1  85  58  41    21.770462  80.319644  7.038096  226.655537  rice
2  60  55  44    23.004459  82.320763  7.840207  263.964248  rice
3  74  35  40    26.491096  80.158363  6.980401  242.864034  rice
4  78  42  42    20.130175  81.604873  7.628473  262.717340  rice

In [3]:
# View basic information related to dataset 

dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2206 entries, 0 to 2205
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   N            2206 non-null   int64
 1   P            2206 non-null   int64
 2   K            2206 non-null   int64
 3   temperature  2203 non-null   float64
 4   humidity     2206 non-null   float64
 5   ph           2203 non-null   float64
 6   rainfall     2202 non-null   float64
 7   label        2206 non-null   object
dtypes: float64(4), int64(3), object(1)
memory usage: 138.0+ KB

## Data Cleaning

In [4]:
# find duplicate rows 

series = dataset.duplicated()
series[series == True]

105     True
176     True
274     True
874     True
1390    True
dtype: bool

In [5]:
# View duplicate rows 

dataset.loc[[105,176,274,874,1390]]

       N   P   K  temperature   humidity        ph    rainfall       label
105   82  43  38    23.286172  81.433216  5.105588  242.317063        rice
176   95  38  22    19.849394  61.245001  5.730617  100.768925       maize
274   22  67  78    17.166064  14.424575  6.204091   72.326675    chickpea
874   33  59  19    23.193053  62.747108  7.641024   49.552133      lentil
1390  92   7  45    26.706078  81.141495  6.944640   51.510336  watermelon

In [6]:
# Remove duplicate rows

dataset.drop([105,176,274,874,1390],axis=0,inplace=True)

In [7]:
# count of duplicate rows to cross check that all duplicates has been removed

dataset.duplicated().sum()

0

In [8]:
# count of null values in every column

col = dataset.columns
col = list(col)
for j in col:
    print(f"{j} => {dataset[j].isnull().sum()}")

N => 0
P => 0
K => 0
temperature => 3
humidity => 0
ph => 3
rainfall => 4
label => 0

In [9]:
# Drop all rows where any value is null, As number of rows are not much so we can drop them

dataset.dropna(inplace=True)
for j in col:
    print(f"{j} => {dataset[j].isnull().sum()}")

N => 0
P => 0
K => 0
temperature => 0
humidity => 0
ph => 0
rainfall => 0
label => 0

## Data Exploration And Visualization

In [15]:
# View columns present

list(dataset.columns)

['N', 'P', 'K', 'temperature', 'humidity', 'ph', 'rainfall', 'label']